#include "W5500.h"
#include "Time.h"
#include "Task.h"

#define NET_DEBUG DEBUG
//#define NET_DEBUG 0
#if NET_DEBUG
	#define net_printf debug_printf
#else
	#define net_printf(format, ...)
#endif

/*
硬件设置部分
硬件:TCP,UDP,ICMP,IPv4,ARP,IGMP,PPPoE

引脚 PMODE[2:0]---- 也可以通过 PHYCFGR 寄存器进行配置
	000		10BI半双工，关闭自动协商
	001		10BI全双工，关闭自动协商
	010		100BI半双工，关闭自动协商
	011		100BI全双工，关闭自动协商
	100		100BI半双工，启用自动协商
	101		未启用
	110		未启用
	111		所有功能，启用自动协商
RSTn	重置		（低电平有效，低电平时间至少500us才能生效）
InTn	中断输出	（低电平有效）--- 程序中 IRQ 引脚
支持SPI 模式0和模式3 自动识别
*/

/*
内部结构
一个通用寄存器区
	0x0000-0x0039	独立寻址，BSB选区
	IP MAC 等整体信息
八个Socket寄存器区
	0x0000-0x0030	独立寻址，BSB选区
8个Socket收发缓存	总缓存32K
	发缓存一共16K(0x0000-0x3fff)  	初始化分配为 每个Socket 2K
	收缓存一共16K(0x0000-0x3fff)  	初始化分配为 每个Socket 2K
	再分配时  收发都不可越16K大边界  地址自动按Socket编号调配
*/

class ByteStruct	// 位域基类
{
public:
	void Init(byte data = 0) { *(byte*)this = data; }
	byte ToByte() { return *(byte*)this; }
};

// 数据帧格式
// 2byte Address + 1byte TConfig + nbyte Data Phase
// 可变数据长度模式下，SCSn 拉低代表W5500的SPI 帧开始（地址段），拉高表示帧结束   （可能跟SPI NSS 不一样）

// 必须设定为1字节对齐，否则offsetof会得到错误的位置
#pragma pack(push)	// 保存对齐状态
// 强制结构体紧凑分配空间
#pragma pack(1)

// 通用寄存器结构
typedef struct
{
	byte MR;			// 模式			0x0000
	byte GAR[4];		// 网关地址		0x0001
	byte SUBR[4];		// 子网掩码		0x0005
	byte SHAR[6];		// 源MAC地址		0x0009
	byte SIPR[4];		// 源IP地址		0x000f
	ushort INTLEVEL;	// 低电平中断定时器寄存器	0x0013
	byte IR;			// 中断寄存器				0x0015
	byte IMR;			// 中断屏蔽寄存器			0x0016
	byte SIR;			// Socket中断寄存器			0x0017
	byte SIMR;			// Socket中断屏蔽寄存器		0x0018
	ushort RTR;			// 重试时间					0x0019
	byte RCR;			// 重试计数					0x001b
	byte PTIMER;		// PPP 连接控制协议请求定时寄存器	0x001c
	byte PMAGIC;		// PPP 连接控制协议幻数寄存器		0x001d
	byte PHAR[6];		// PPPoE 模式下目标 MAC 寄存器		0x001e
	byte PSID[2];		// PPPoE 模式下会话 ID 寄存器		0x0024
	byte PMRU[2];		// PPPoE 模式下最大接收单元			0x0026
	byte UIPR[4];		// 无法抵达 IP 地址寄存器【只读】	0x0028
	byte UPORTR[2];		// 无法抵达端口寄存器【只读】		0x002c
	byte PHYCFGR;		// PHY 配置寄存器					0x002e
	//byte VERSIONR		// 芯片版本寄存器【只读】			0x0039	// 地址不连续
}TGeneral;			// 只有一份 所以直接定义就好

typedef struct
{
	byte MR;		//0x0000  	// Socket 模式寄存器
	byte CR;		//0x0001  	// 配置寄存器 	【较为特殊】【只写，读为0x00】
	byte IR;		//0x0002  	// 中断寄存器	 写1清0？？
	byte SR;		//0x0003  	// 状态寄存器	【只读】
	byte PORT[2];	//0x0004  	// TCP UDP 模式下端口号  OPEN之前配置好
	byte DHAR[6];	//0x0006  	// 目的MAC,SEND_MAC使用;CONNECT/SEND 命令时ARP获取到的MAC
	byte DIPR[4];	//0x000c  	// 目标IP地址
	byte DPORT[2];	//0x0010  	// 目标端口
	byte MSSR[2];	//0x0012  	// TCP UDP 模式下 MTU 最大传输单元大小  默认最大值
									// TCP:1460; UDP:1472; MACRAW:1514;
									// MACRAW 模式时 由于MTU 不在内部处理，默认MTU将会生效
									// PPPoE 模式下 略
									// TCP UDP 模式下，传输数据比 MTU大时，数据将会自动划分成默认MTU 单元大小
	byte Reserved;	//0x0014
	byte TOS;		//0x0015  	// IP包头 服务类型 	OPEN之前配置
	byte TTL;		//0x0016  	// 生存时间 TTL 	OPEN之前配置
	byte Reserved2[7];	//0x0017  	-  0x001d
	byte RXBUF_SIZE;//0x001e  	// 接收缓存大小   1 2 4 8 16  单位KByte
	byte TXBUF_SIZE;//0x001f  	// 发送缓存大小   1 2 4 8 16  单位KByte
	byte TX_FSR[2];	//0x0020  	// 空闲发送寄存器大小
	byte TX_RD[2];	//0x0022  	// 发送读缓存指针
	byte TX_WR[2];	//0x0024  	// 发送写缓存指针
	byte RX_RSR[2];	//0x0026  	// 空闲接收寄存器大小
	byte RX_RD[2];	//0x0028  	// 接收读缓存指针
	byte RX_WR[2];	//0x002a  	// 接收写缓存指针
	byte IMR;		//0x002c  	// 中断屏蔽寄存器  结构跟IR一样 0屏蔽  1不屏蔽
	byte FRAG[2];	//0x002d  	// IP包头 分段部分  分段寄存器

	byte KPALVTR;	//0x002f  	// 只在TCP模式下使用  在线时间寄存器  单位：5s
									// 为0 时  手动SEND_KEEP
									// > 0 时  忽略SEND_KEEP操作
}TSocket;

#pragma pack(pop)	// 恢复对齐状态

// 位域 低位在前
// 配置寄存器  TConfig 结构
typedef struct : ByteStruct
{
	byte OpMode:2;		// SPI 工作模式
					// 00	可变数据长度模式，N字节数据段（1<=N）
					// 01	固定数据长度模式，1字节数据长度（N=1）
					// 10	固定数据长度模式，1字节数据长度（N=2）
					// 11	固定数据长度模式，1字节数据长度（N=4）
					// 固定模式不需要NSS （芯片NSS 接地） 可变模式SPI NSS 受控

	byte ReadWrite:1;	// 0：读	1：写


	byte BlockSelect:2;	// 区域选择位域		// 1个通用寄存器   8个Socket寄存器组（选择，写缓存，收缓存）
					// 00000	通用
					// XXX01	SocketXXX 寄存器
					// XXX10	SocketXXX 发缓存
					// XXX11	SocketXXX 收缓存
					// 其余保留， 如果选择了保留的将会导致W5500故障
	byte Socket:3;		// Socket组，0表示通用寄存器
}TConfig;

// 通用寄存器结构
// 模式寄存器
typedef struct : ByteStruct
{
	byte Reserved:1;
	byte FARP:1;		// 强迫ARP		0 关闭，1开启	强迫ARP模式下，无论是否发送数据都会强迫ARP请求
	byte Reserved2:1;
	byte PPPoE:1;		// PPPoE 		0 关闭，1开启
	byte PB:1;			// Ping 屏蔽位	1 ping不响应，0 ping 有响应
